function regular_sampling_image = regular_mode_sampling(p,bound)
%===============================================================================================%
%							常规模式采样函数													%
%							p:采样点间距														%
%							bound:图像范围														%
%===============================================================================================%
	x1		= (-bound:p:bound)';			
	N		= length(x1);
	x1		= repmat(x1,1,N);				%水平方向坐标
	x2		= x1';							%垂直方向坐标
	regular_sampling_image= uint8(127.5 + 127.5 * cos((1440./pi) ./ (1 + 512./sqrt(8 * (x1.^2 + x2.^2)))));
end
